app/views/cleaners/_form.html.erb

  <ul>
    <%= f.collection_check_boxes(:city_ids, City.all, :id, :name) %>
---
SELECT "cities".* FROM "cities"