app/views/cleaners/show.html.erb

  <strong>Cities:</strong>
  <%= @cleaner.cities.pluck(:name).to_s %>
---
SELECT "cities"."name" FROM "cities" INNER JOIN "city_cleaners" ON "cities"."id" = "city_cleaners"."city_id" WHERE "city_cleaners"."cleaner_id" = ?  [["cleaner_id", 1]]