app/views/customers/_form.html.erb

    <%= f.label :city %><br>
    <%= f.select :city_id, options_for_select(City.all.collect { |city| [city.name, city.id] })%>
---
SELECT "cities".* FROM "cities"