app/views/orders/_form.html.erb

SELECT "cities".* FROM "cities"
---
    <%= f.label :city %><br>
    <%= f.select :city_id, options_for_select(City.all.collect { |city| [city.name, city.id] })%>

SELECT "suppliers".* FROM "suppliers"
---
    <%= f.label :supplier %><br>
    <%= f.select :supplier_id, options_for_select(Supplier.all.collect { |city| [city.first_name, city.id] })%>

SELECT "customers".* FROM "customers"
---
    <%= f.label :customer %><br>
    <%= f.select :customer_id, options_for_select(Customer.all.collect { |city| [city.first_name, city.id] })%>