app/controllers/cleaners_controller.rb

SELECT "cleaners".* FROM "cleaners"
---
  def index
    @cleaners = Cleaner.all

SELECT "cities".* FROM "cities"
---
  def edit
    @cities = City.all

SELECT "cities".* FROM "cities"
UPDATE "cleaners" SET "quality_score" = ?, "updated_at" = ? WHERE "cleaners"."id" = ?  [["quality_score", 5.0], ["updated_at", "2017-06-16 11:23:26.781612"], ["id", 1]]
---
  def update
    @cities = City.all
    respond_to do |format|
      if @cleaner.update(cleaner_params)

SELECT  "cleaners".* FROM "cleaners" WHERE "cleaners"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cleaner
      @cleaner = Cleaner.find(params[:id])