app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("first_name", "last_name", "phone", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Paul"], ["last_name", "Leoniuk"], ["phone", "0664537957"], ["city_id", 1], ["created_at", "2017-06-20 11:13:54.787353"], ["updated_at", "2017-06-20 11:13:54.787353"]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]