app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.all

INSERT INTO "orders" ("supplier_id", "customer_id", "city_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["supplier_id", 1], ["customer_id", 1], ["city_id", 2], ["date", "2017-06-20 11:23:00.000000"], ["created_at", "2017-06-20 11:24:21.518270"], ["updated_at", "2017-06-20 11:24:21.518270"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_order
      @order = Order.find(params[:id])