app/controllers/suppliers_controller.rb

SELECT "suppliers".* FROM "suppliers"
---
  def index
    @suppliers = Supplier.all

INSERT INTO "suppliers" ("first_name", "last_name", "product_name", "phone", "compony", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @supplier = Supplier.new(supplier_params)

    respond_to do |format|
      if @supplier.save

SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_supplier
      @supplier = Supplier.find(params[:id])