app/controllers/welcome_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @customers = Customer.all

INSERT INTO "customers" ("first_name", "last_name", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Paul"], ["last_name", "Leoniuk"], ["phone_number", "+555555"], ["created_at", "2017-06-16 09:40:41.448827"], ["updated_at", "2017-06-16 09:40:41.448827"]]
---
  def sign_in
    customer = set_customer
    if customer.present?
      redirect_to customer_booking_path(customer: @customer),
                                       notice: 'Customer is already registered.'
    else
      @customer = Customer.new(customer_params)

      respond_to do |format|
        if @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 6]]
---
  def booking
    @booking = Booking.new
    @customer = Customer.find(params[:customer])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
SELECT "city_cleaners"."cleaner_id" FROM "city_cleaners" WHERE "city_cleaners"."city_id" = ?  [["city_id", 1]]
SELECT "bookings"."cleaner_id" FROM "bookings" WHERE "bookings"."city_id" = ? AND "bookings"."date" = ?  [["city_id", 1], ["date", "2017-06-16 10:55:00.000000"]]
SELECT  "cleaners".* FROM "cleaners" WHERE "cleaners"."id" IN (1, 1, 1) AND ("cleaners"."id" IS NOT NULL)  ORDER BY "cleaners"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "cleaners" WHERE "cleaners"."id" IN (1, 1, 1) AND ("cleaners"."id" NOT IN (NULL, NULL))
INSERT INTO "bookings" ("city_id", "customer_id", "cleaner_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city_id", 1], ["customer_id", 3], ["cleaner_id", 1], ["date", "2017-06-16"], ["created_at", "2017-06-16 10:59:56.911260"], ["updated_at", "2017-06-16 10:59:56.911260"]]
---
  def result
    date = get_date(params)
    city = City.find_by(id: params[:booking][:city_id])
    city_cleaners_ids = CityCleaner.where(city_id: city.id).pluck(:cleaner_id)
    city_unavailable_cleaner_ids = Booking.where(city_id: city.id).where(date: date).pluck(:cleaner_id)
    city_free_cleaners = Cleaner.where(id: city_cleaners_ids).where.not(id: [city_unavailable_cleaner_ids])
    puts city_free_cleaners.pluck(:id)
    if city_free_cleaners.any?
        @booking = Booking.new(city_id: city.id,
                               customer_id: params[:customer_id],
                               cleaner_id: city_free_cleaners.first.id,
                               date: date)
    end

    respond_to do |format|
      if city_free_cleaners&.any? && @booking.save

SELECT  "customers".* FROM "customers" WHERE "customers"."phone_number" = ? LIMIT 1  [["phone_number", "+555555"]]
---
  def set_customer
    @customer = Customer.find_by(phone_number: params[:customer][:phone_number])